# Introduction to `rekon`

In [1]:
from rekon import rekon

In [2]:
rec = rekon.Reconciliation()
rec.load_sample_data()

In [3]:
rec.system1_df

  product  quantity  price
0       a       100      1
1       b        22      5
2       c        10     10
3       d        20      3

In [4]:
rec.system2_df

  item  volume  cost
0   a1     100     1
1   b1      20     5
2   c1      10    10

In [5]:
rec.system_labels

['system1', 'system2']

In [8]:
rec.column_mappings

    system1 system2
0   product    item
1  quantity  volume
2     price    cost

In [9]:
rec.row_mappings

  system1 system2
0       a      a1
1       b      b1
2       c      c1
3       d      d1

In [12]:
rec.reconcile(rec_column=1, sqlite_db=":memory:")

Normalising tables...
Normalised tables inserted to database...
Mappings added to database..

  s1_key s2_key  s1_value1  s2_value1  s1s2_value1_diff
0      a     a1        100      100.0               0.0
1      b     b1         22       20.0               2.0
2      c     c1         10       10.0               0.0
3      d   None         20        NaN               NaN

In [14]:
rec.rec_result

  s1_key s2_key  s1_value1  s2_value1  s1s2_value1_diff
0      a     a1        100      100.0               0.0
1      b     b1         22       20.0               2.0
2      c     c1         10       10.0               0.0
3      d   None         20        NaN               NaN